<?php

return [
    'plural' => 'منتجات السيارة',
    'singular' => 'منتج السيارة',
    'empty' => 'لا توجد منتجات',
    'select' => 'اختر منتج السيارة',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل منتجات السيارة',
        'show' => 'عرض',
        'create' => 'إضافة منتجات جديدة للسيارة',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات منتج السيارة',
        'delete' => 'حذف منتج السيارة',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث منتجات السيارة',
        'return' => 'إرجاع منتجات إلى المخزن',
    ],
    'messages' => [
        'created' => 'تم إضافة منتج السيارة بنجاح',
        'updated' => 'تم تعديل منتج السيارة بنجاح',
        'deleted' => 'تم حذف منتج السيارة بنجاح',
        'returned' => 'تم أرجاع المنتج إلى المستودع بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'product' => 'المنتج',
        'quantity' => 'الكمية',
        'products' => 'المنتجات',
        'Quantities' => 'الكمية المتاحة',
        'created_at' => 'تاريخ ألإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا منتج السيارة ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ]
];
