<?php

return [
    'plural' => 'مصروفات الشركة',
    'singular' => 'مصروف الشركة',
    'empty' => 'لا توجد مصروفات للشركة',
    'select' => 'اختر مصروفات الشركة',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل مصروفات الشركة',
        'show' => 'عرض',
        'create' => 'إضافة مصروفات جديدة للشركة',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات مصروفات الشركة',
        'delete' => 'حذف مصروفات الشركة',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث مصروفات الشركة',
    ],
    'messages' => [
        'created' => 'تم إضافة مصروفات الشركة بنجاح',
        'updated' => 'تم تعديل مصروفات الشركة بنجاح',
        'deleted' => 'تم حذف مصروفات الشركة بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'salesman' => 'المندوب',
        'salesman_id' => 'المندوب',
        'category_id' => 'قسم المصروفات',
        'title' => 'عنوان المصروفات',
        'description' => 'وصف المصروفات',
        'value' => 'قيمة المصروفات',
        'created_at' => 'تاريخ الإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف مصروفات الشركة ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ]
];
