<?php

return [
    'plural' => 'العملاء',
    'singular' => 'العميل',
    'empty' => 'لا توجد عملاء',
    'select' => 'اختر العميل',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل العملاء',
        'show' => 'عرض',
        'create' => 'إضافة عميل جديد',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات العميل',
        'delete' => 'حذف العميل',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث العملاء',
    ],
    'messages' => [
        'created' => 'تم إضافة العميل بنجاح',
        'updated' => 'تم تعديل العميل بنجاح',
        'deleted' => 'تم حذف العميل بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'salesman_id' => 'مندوب مبيعات',
        'reference_id' => 'الرقم المرجعي',
        'name' => 'الاسم',
        'phone' => 'رقم الهاتف',
        'phone_2' => 'رقم الهاتف',
        'area_id' => 'المنطقة',
        'address' => 'العنوان',
        'lat' => 'خطوط الطول',
        'lng' => 'دوائر العرض',
        'created_at' => 'تاريخ الإنضمام',
        'status' => 'الحالة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا العميل ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
