<?php

return [
    'plural' => 'الإشعارات',
    'singular' => 'ألأشعار',
    'empty' => 'لا توجد أشعارات',
    'select' => 'اختر ألأشعار',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل الإشعارات',
        'show' => 'عرض',
        'create' => 'إضافة أشعار جديد',
        'new' => 'إضافة أشعار جديد',
        'edit' => 'تعديل ألأشعار',
        'delete' => 'حذف ألأشعار',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة ألأشعار بنجاح',
        'updated' => 'تم تعديل ألأشعار بنجاح',
        'deleted' => 'تم حذف ألأشعار بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'application' => 'التطبيق',
        'user' => 'المستخدم',
        'clients' => 'المستخدمين',
        'all_clients' => 'العملاء',
        'all_winches' => 'اوناش الانقاذ',
        'all_workshops' => 'ورش الصيانة',
        'title' => 'عنوان ألأشعار',
        'body' => 'محتوى ألأشعار',
        'created_at' => 'تاريخ ألإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا ألأشعار ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ]
];
