<?php

return [
    'plural' => 'أقساط المنتج',
    'singular' => 'قسط المنتج',
    'empty' => 'لا توجد أقساط للمنتج',
    'select' => 'اختر قسط المنتج',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل أقساط المنتج',
        'show' => 'عرض',
        'create' => 'إضافة قسط جديد',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات قسط المنتج',
        'delete' => 'حذف قسط المنتج',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث أقساط المنتج',
    ],
    'messages' => [
        'created' => 'تم إضافة قسط المنتج بنجاح',
        'updated' => 'تم تعديل قسط المنتج بنجاح',
        'deleted' => 'تم حذف قسط المنتج بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'value' => 'قيمة القسط',
        'status' => 'الحالة',
        'created_at' => 'تاريخ ألإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا قسط المنتج ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ]
];
