<?php

return [
    'plural' => 'أقساط البيعة',
    'singular' => 'قسط البيعة',
    'empty' => 'لا توجد أقساط للبيعة',
    'select' => 'اختر قسط البيعة',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل أقساط البيعة',
        'show' => 'عرض',
        'create' => 'إضافة قسط جديد',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات قسط البيعة',
        'delete' => 'حذف قسط البيعة',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث أقساط البيعة',
    ],
    'messages' => [
        'created' => 'تم إضافة قسط البيعة بنجاح',
        'updated' => 'تم تعديل قسط البيعة بنجاح',
        'deleted' => 'تم حذف قسط البيعة بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'due_date' => 'تاريخ استحقاق القسط',
        'value' => 'قيمة القسط',
        'status' => 'الحالة',
        'created_at' => 'تاريخ ألإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا قسط البيعة ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'PAID' => 'مدفوع',
        'UNPAID' => 'غير مدفوع',
    ]
];
