<?php

return [
    'plural' => 'مندوبين المبيعات',
    'singular' => 'مندوب مبيعات',
    'empty' => 'لا توجد مندوبين للمبيعات',
    'select' => 'اختر مندوب المبيعات',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل مندوبين المبيعات',
        'show' => 'عرض',
        'create' => 'إضافة مندوب مبيعات جديد',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات مندوب المبيعات',
        'delete' => 'حذف مندوب مبيعات',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث مندوبين المبيعات',
    ],
    'messages' => [
        'created' => 'تم إضافة مندوب المبيعات بنجاح',
        'updated' => 'تم تعديل مندوب المبيعات بنجاح',
        'deleted' => 'تم حذف مندوب المبيعات بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'name' => 'الاسم',
        'phone' => 'رقم الهاتف',
        'email' => 'البريد الإلكتروني',
        'created_at' => 'تاريخ الإنضمام',
        'old_password' => 'كلمة المرور القديمة',
        'password' => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'avatar' => 'الصورة الشخصية',
        'status' => 'الحالة'
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا مندوب مبيعات ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],
    'status' => [
        'ACTIVE' => 'مفعل',
        'INACTIVE' => 'غير مفعل',
    ],
];
