<?php

return [
    'plural' => 'المخازن',
    'singular' => 'المخزن',
    'empty' => 'لا توجد مخازن',
    'select' => 'اختر المخزن',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'actions' => 'ألإجراءات',
        'list' => 'كل المخازن',
        'show' => 'عرض',
        'create' => 'إضافة منتجات جديد للمخزن',
        'new' => 'جديد',
        'edit' => 'تعديل بيانات المخزن',
        'delete' => 'حذف المخزن',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'latest' => 'أحدث المخازن',
    ],
    'messages' => [
        'created' => 'تم إضافة المخزن بنجاح',
        'updated' => 'تم تعديل المخزن بنجاح',
        'deleted' => 'تم حذف المخزن بنجاح',
        'retrieved' => 'تم أسترجاع البيانات بنجاح',
    ],
    'attributes' => [
        'id' => 'الرقم التسلسلي',
        'title' => 'الاسم',
        'description' => 'الوصف',
        'product' => 'المنتج',
        'quantity' => 'الكمية المتاحة',
        'products' => 'المنتجات',
        'Quantities' => 'الكمية المتاحة',
        'created_at' => 'تاريخ ألإضافة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا المخزن ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ]
];
